_posts/2015-08-26-first-year-review.html
---
layout: post
title: Notes on the First Year of Grad School
---

<p>
When deciding which program to join for my PhD I came across Jerzy's
<a href="http://civilstat.com/">blog</a>. His <a href="http://civilstat.com/2014/02/after-1st-semester-of-statistics-phd-program/">post</a> on the 1st semester was very helpful in confirming that
CMU was the place for me. You definitely should read all of them: <a href="http://civilstat.com/2014/02/after-1st-semester-of-statistics-phd-program/">1st</a>,
<a href="http://civilstat.com/2014/05/after-2nd-semester-of-statistics-phd-program/">2nd</a>, <a href="http://civilstat.com/2014/12/after-3rd-semester-of-statistics-phd-program/">3rd</a>, and <a href="http://civilstat.com/2015/06/after-4th-semester-of-statistics-phd-program/">4th</a> thus far. Anyways, as an act of blatant imitation,
here's my own review of the first year.
</p>

<blockquote>
<p>
Attention Conservation Notice:<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> Of interest mostly to other
PhD students.  Sample size of one; may not replicate
</p>
</blockquote>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Lessons Learned</h2>
<div class="outline-text-2" id="text-1">
<p>
Before I start in on the presumably boring details, I found it
helpful to distill the entire experience into a few short "lessons".
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Know thyself</h3>
<div class="outline-text-3" id="text-1-1">
<p>
There's no doubt that the first year of grad school is a humbling
experience. You're exposed to the many things you don't know and
you must work very hard to start correcting that situation. Without
a good sense of your limitations this is incredibly exhausting. So
knowing when you're tired and frustrated and knowing what to do to
fix that is essential. I find that exercise and a book are helpful.
</p>

<p>
That being said, it's also nice to "internalize that you are, in
fact, a badass", to borrow a phrase from <a href="http://bactra.org/weblog/900.html">Cosma Shalizi</a>. It's quite
a morale boost to realize just how far you've come in a relatively
short amount of time. So while in the middle of a measure theory
problem set, just remember that only a few months ago you had
couldn't even understand the statement of the problem you're
solving.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Know your tools</h3>
<div class="outline-text-3" id="text-1-2">
<p>
On a more quotidian level, this year has been an education in the
mechanics of getting work done. With problem sets due every week,
homeworks to be graded, papers to read, and research to be done you
need to get on top of things. Investing a little time in improving
the process by which you accomplish these tasks will pay off in the
long run. All that to say, my emacs-fu has gotten much stronger
this year.
</p>

<p>
I'll just list a few of the tools and commands which I now find
indispensable:
</p>
<ul class="org-ul">
<li>emacs, especially elfeed (rss), mu4e (email) and above all
org-mode (uncategorizable)
</li>
<li>git and github (students get <a href="https://education.github.com/pack">free micro accounts</a>)
</li>
<li>ssh
</li>
<li>rake
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Know the people around you</h3>
<div class="outline-text-3" id="text-1-3">
<p>
One of the aspects of CMU which had escaped my notice before
deciding to attend was the wonderful culture. The students are very
friendly and the professors helpful. This is nice because you
occasionally hear stories of the academic version of
Thunderdome<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>: "two men enter, one leaves" (with a
diploma). Instead, things are very cooperative which is fortunate
since you can benefit from specialization of knowledge; you help me
understand real analysis and I help you understand programming. On
a less transactional level, you spend quite a bit of time with
these people and assuming you're staying in the field will never
quite escape them; so it's just as well that you befriend them.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Coursework</h2>
<div class="outline-text-2" id="text-2">
<p>
Now for the nitty-gritty of the first year. A great deal of time and
effort in the first year was spent on coursework. CMU front-loads the
coursework so that we're done with required courses very early. Thus
the courses are meant to get you up to speed for research.
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Fall</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">10-701 Machine Learning</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
A whirlwind tour of various algorithms ranging from the familiar
linear and penalized regression to the new-to-me perceptron and
SVM. My biggest gripe was that they required us to code in
Matlab's open-source cousin Octave.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2">36-699 Statistical Immigration</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
This was excellent. This was not a class, merely a scheduled time
for each of the faculty to give a short talk about their work. It
was extremely helpful not only so I could recognize all of the
faculty, but so that I had a first approximation to what everyone
was doing. Several professors also took this time to advertise ADA
projects which was also helpful.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3">36-705 Intermediate Statistics</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Coming from a heavily Bayesian school (Duke) I had a lot to
learn/refresh about classical statistics. Larry Wasserman's course
was the way to quickly get up to speed. More or less following the
content of his <a href="http://www.amazon.com/All-Statistics-Statistical-Inference-Springer/dp/0387402721">All of Statistics</a><sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>, it was the perfect way
to get into the swing of things.
</p>
</div>
</div>
<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4">36-707 Regression Analysis</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
All of the other courses were heavy on math and theory, so 707
served as our connection with "real" data analysis. I thought I
had regression all figured out, but this class helped fill in some
of the gaps in my education.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Spring</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">36-702 Statistical Machine Learning</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Where 701 was a whirlwind introduction to several methods, 702
went back and looked at the theory behind those methods. Co-taught
by Larry Wasserman and Ryan Tibshirani, this course was my
favorite thus far.
</p>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">36-752 Advanced Probability</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
This was our introduction to Measure Theory. I definitely
benefited from being a math major in college. The actual content
of my undergrad courses was not particularly helpful, but the
mental patterns for figuring out proofs were crucial.
</p>
</div>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3">36-757 Advanced Data Analysis</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
This was also not exactly a course so much as a scheduled time to
give short talks about our progress on our ADA projects. It's been
great to have a variety of opportunities to practice speaking. The
only way to get better is to practice, and this course gave us
plenty of feedback on our skills.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Not Coursework</h2>
<div class="outline-text-2" id="text-3">
<p>
Of course, not everything is about coursework.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">ADA Project</h3>
<div class="outline-text-3" id="text-3-1">
<p>
All PhD students in the department have an Advanced Data Analysis
(ADA) project which they typically complete over the course of
their first spring and second fall. Mine is working with recordings
of neural activity in Parkinsonian mice. The experience working
with real data has been educational and it serves to connect all of
the work we've been doing in our course with actual data analysis.
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">TAing</h3>
<div class="outline-text-3" id="text-3-2">
<p>
I was a TA for 36-225 in the fall and 36-217 in the spring. While
not necessarily the most exciting aspect of the program, I've
framed the work as practice at conveying statistical ideas to
non-statisticians. Office hours are enjoyable, although grading
papers is a grind.
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Summer</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Over the summer I worked as a TA for our summer research program
for undergraduates. This was a great deal of fun. Once a week I ran
an R tutorial for the entire program and the rest of the time I
worked with a small group on their project. Their dataset was
gene-expression levels in autistic and control brains and the goal
was finding <i>differentially-expressed</i> genes. It was an excellent
context in which to bring up multiple-comparison testing,
permutation tests, and correcting for confounding variables.
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">Non-academic Activities</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Whether it's playing intramurals, walking in Schenley Park, or
getting books from the public library, it's good to get out of the
department. I've particularly enjoyed setting up my hammock on
Flagstaff Hill and relaxing with a good book from the Carnegie
Library of Pittsburgh.
</p>

<p>
A lot of the time the department has come along, as our cohort has
been very good at socializing outside of the department. I've even
hosted a few board<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup> game nights at my apartment.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
As further evidence of my lack of originality with this
post I decided to borrow from <a href="http://bactra.org/weblog/">Cosma Shalizi</a>, although in the course of
writing this I actually followed his <a href="http://www.viridiandesign.org/notes/1-25/Note%2000002.txt">link</a> and apparently he got it
from Bruce Sterling.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
I'll admit, this would make thesis defense more
interesting. As always, xkcd got there <a href="https://xkcd.com/1403/">first</a>.
</p></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara">
I don't quite know why he needed to write <a href="http://www.amazon.com/All-Nonparametric-Statistics-Springer-Texts/dp/0387251456/ref=asap_bc?ie=UTF8">All of
Nonparametric Statistics</a> when it clearly must be a subset of <a href="http://www.amazon.com/All-Statistics-Statistical-Inference-Springer/dp/0387402721">All of Statistics</a>.
</p></div>

<div class="footdef"><sup><a id="fn.4" name="fn.4" class="footnum" href="#fnr.4">4</a></sup> <p class="footpara">
Protip: be sure to specify board games, otherwise
everything devolves into a party game like Cards Against Humanity.
</p></div>


</div>
</div>
